Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [5]:
series1=pd.Series([4, 8, 15, 16, 23,42],index=['a','b','c','d','e','f'])

In [6]:
print(series1)

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
lst=['simran','tanya','nazish','Riya','Pratibha','Shivangi','Arif','Asad','Shubham','Niyati']

In [8]:
df=pd.DataFrame(lst)

In [9]:
df

          0
0    simran
1     tanya
2    nazish
3      Riya
4  Pratibha
5  Shivangi
6      Arif
7      Asad
8   Shubham
9    Niyati

In [10]:
data=[['Alice ',25,'Female'],['Bob',30,'Male'],['claire',25,'female']]

In [13]:
df1 = pd.DataFrame(data, columns=['Name', 'Age','gender'])

In [14]:
df1

     Name  Age  gender
0  Alice    25  Female
1     Bob   30    Male
2  claire   25  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example. 
ANS=As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined

Example of pandas series

In [12]:

# Create a Pandas Series from a list
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

# Print the Series
print(s)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

Example of data frame

In [14]:
import pandas as pd

# Create a DataFrame with a single column using a Python list
data = [1000, 2000, 3000, 4000, 5000]
df = pd.DataFrame(data, columns=['Column1'])

# Print the DataFrame
print(df)

   Column1
0     1000
1     2000
2     3000
3     4000
4     5000

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

isnull() This function helps you to check if there in which row and which column your data has missing values. 
fillna() This function is used to replace missing values or NaN in the df with user-defined values. 
sort_values() 
df.value_counts()

In [20]:
import pandas as pd

data = {'item': ['laptop', 'monitor', 'HDMI', 'speaker'],
        'cost': [500, 300, 700, 600]
       }

df = pd.DataFrame(data)

sorted_data = df.sort_values(by='cost', ascending=True)

sorted_data

      item  cost
1  monitor   300
0   laptop   500
3  speaker   600
2     HDMI   700

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Panel

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000